# IsReferenceLine Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveByPoints..::..IsReferenceLine Property
CurveByPoints Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsReferenceLine { get; set; }
```

Visual Basic
---
```text
Public Property IsReferenceLine As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsReferenceLine {
	bool get ();
	void set (bool value);
}
```

# See Also
CurveByPoints Class
Autodesk.Revit.DB Namespace